<?php

global $presentations;
$presentations = [

    'sql' => [
        'title' => 'MySQL & NoSQL',
        'presenter' => 'nadalizadeh',
        'level' => 'مبتدی و متوسط',
        'time' => '',
        'room' => 'سالن آمفی تئاتر',
        'desc' => '
            ...
            '
    ],

    //--------------------------------------------------------------

    'opensource' => [
        'title' => 'OpenSource Revenue Concepts',
        'presenter' => 'mohajer',
        'level' => 'مبتدی و متوسط',
        'time' => 'روز اول ساعت ۱۱:۳۰ تا ۱۲',
        'room' => 'سالن آمفی تئاتر',
        'desc' => '
مدل‌های درآمدزایی در بنگاه‌های متن‌باز
نرم‌افزارهای متن‌باز سال‌هاست که وجود دارند و همیشه بعد از شنیدن این واژه اولین چیزی که به ذهن همه‌ی ما می‌رسد «نرم‌افزار‌های رایگان» است. نرم‌افزار رایگان بلافاصله برای یک سرمایه‌گذار محصولی بدون درآمد و برای استفاده‌کننده محصولی بدون پشتیبانی را تداعی می‌کند. اما با این وجود بنگاه‌های متن‌باز توانسته‌اند در سال‌های گذشته با استفاده از مدل‌های درآمدزایی خاص خودشان سود زیادی به جیب بزنند.تغییر نیازهای مشتریان از محصول به خدمات، گسترش فوق‌العاده‌ی فضای مجازی و سرعت زیاد تغییر تکنولوژی‌های نرم‌افزار باعث شده بنگاه‌های سنتی هم نیم‌نگاهی به گسترش نرم‌افزارها به صورت متن‌باز داشته باشند. آیا همچنان باید کدهای برنامه را در پستو نگه داشت؟ یا این که با انتشار کدها و گسترش نرم‌افزار به صورت متن‌باز هم، راهی برای پولدار شدن هست؟

            '
    ],

    //--------------------------------------------------------------

    'copyleft' => [
        'title' => 'Patents & Copyright',
        'presenter' => 'jadi',
        'level' => 'مبتدی و متوسط',
        'time' => '',
        'room' => 'سالن آمفی تئاتر',
        'desc' => '
            ...
            '
    ],

    //--------------------------------------------------------------

    'ecommerce' => [
        'title' => 'E-Commerce',
        'presenter' => '',
        'level' => 'مبتدی و متوسط',
        'time' => '',
        'room' => 'سالن آمفی تئاتر',
        'desc' => '
            ...
            '
    ],

    //--------------------------------------------------------------

    'bigdata' => [
        'title' => 'Data Intensive Computing Platforms',
        'presenter' => 'peyberah',
        'level' => 'مبتدی و متوسط',
        'time' => '',
        'room' => 'سالن آمفی تئاتر',
        'desc' => '
در سال‌های اخیر، ما شاهد افزایش چشمگیر تولید داده بوده‌ایم. با تقریب می‌توان گفت که ۹۰٪ کل داده‌های ذخیره‌شده‌ی موجود در دنیا، در دو سال قبل تولید شده‌اند، و برای اولین بار در تاریخ، در سال ۲۰۰۷ بود که حجم داده‌های تولیدی فراتر از فضای موجود برای ذخیره‌سازی آن‌ها رفت. این داده‌های بزرگ، که Big Data نامیده می‌شوند، دارای مشخصات مشترکی هستند که می‌توان به حجم بالای داده، نرخ تولید بالا و تنوع محتوا اشاره کرد. برای ذخیره‌سازی و پردازش این داده‌های عظیم، ابزارهای متنوع و زیادی تولید شده‌است. تعداد و تنوع موجود در این ابزارها، امکان انتخاب ابزار مناسب برای کارهای مختلف را مشکل کرده‌است. بعضی از این ابزارها به صورت خاص‌منظوره و برای کار مشخصی طراحی شده‌اند (برای مثال برای پردازش داده‌های جاری و یا گراف)، و بعضی از آن‌ها، مانند Hadoop MapReduce و Spark، حالتی کلی‌تر دارند و برای انواع پردازش‌ها می‌توانند مورد استفاده قرار بگیرند. در این ارائه، سعی داریم تا مروری بر این ابزارها داشته باشیم و به طور خلاصه بعضی از آن‌ها را معرفی کنیم.<br>
<br>

            '
    ],

    //--------------------------------------------------------------

    'ssh' => [
        'title' => 'The Dark Arts of SSH',
        'presenter' => 'pooya',
        'level' => 'متوسط و پیشرفته',
        'time' => '',
        'room' => 'سالن آمفی تئاتر',
        'desc' => '
            ...
            '
    ],

    //--------------------------------------------------------------

    'xamin' => [
        'title' => 'Xamin Project',
        'presenter' => 'xamin',
        'level' => 'مبتدی و متوسط',
        'time' => '',
        'room' => 'سالن آمفی تئاتر',
        'desc' => '
            ...
            '
    ],

];

global $workshops;
$workshops = [

    'intro' => [
        'title' => 'Linux Intro',
        'presenter' => '',
        'level' => 'مبتدی و متوسط',
        'time' => 'هر دو روز',
        'room' => 'سایت کامپیوتر',
        'desc' => '
             اول شرکت کننده ها به طور مختصر با سیستم عامل لینوکس و قابلیت های اون آشنا می شن
            '
    ],

    //--------------------------------------------------------------

    'kernel' => [
        'title' => 'Linux kernel',
        'presenter' => 'bakhshis',
        'level' => 'متوسط و پیشرفته',
        'time' => 'هر دو روز',
        'room' => '',
        'desc' => '
            ...
            '
    ],

    //--------------------------------------------------------------

    'network' => [
        'title' => 'Networking in linux',
        'presenter' => '',
        'level' => 'مبتدی و متوسط',
        'time' => 'هر دو روز',
        'room' => '',
        'desc' => '
            ...
            '
    ],


    //--------------------------------------------------------------

    'programming' => [
        'title' => 'Linux API Programming',
        'presenter' => 'faraz',
        'level' => 'مبتدی و متوسط',
        'time' => 'هر دو روز',
        'room' => '',
        'desc' => '
            ...
            '
    ],

    //--------------------------------------------------------------

    'python' => [
        'title' => 'Python',
        'presenter' => 'parham',
        'level' => 'مبتدی و متوسط',
        'time' => 'هر دو روز',
        'room' => 'کلاس ۱۰۱',
        'desc' => '
            کارگاه خیلی خفن پایتون
            '
    ],

];
