<?php

global $presentations;
$presentations = [

    'sql' => [
        'title' => 'MySQL & NoSQL and afew steps folan',
        'presenter' => 'nadalizadeh',
        'level' => 'مبتدی و متوسط',
        'time' => '',
        'room' => 'سالن آمفی تئاتر',
        'desc' => '
            ...
            '
    ],

    //--------------------------------------------------------------

    'opensource' => [
        'title' => 'OpenSource Revenue concepts',
        'presenter' => 'mohajer',
        'level' => 'مبتدی و متوسط',
        'time' => 'روز اول ساعت ۱۱:۳۰ تا ۱۲',
        'room' => 'سالن آمفی تئاتر',
        'desc' => '
نرم‌افزارهای متن‌باز سال‌هاست که وجود دارند و همیشه بعد از شنیدن این واژه اولین چیزی که به ذهن همه‌ی ما می‌رسد «نرم‌افزار‌های رایگان» است. نرم‌افزار رایگان بلافاصله برای یک سرمایه‌گذار محصولی بدون درآمد و برای استفاده‌کننده محصولی بدون پشتیبانی را تداعی می‌کند. اما با این وجود بنگاه‌های متن‌باز توانسته‌اند در سال‌های گذشته با استفاده از مدل‌های درآمدزایی خاص خودشان سود زیادی به جیب بزنند.تغییر نیازهای مشتریان از محصول به خدمات، گسترش فوق‌العاده‌ی فضای مجازی و سرعت زیاد تغییر تکنولوژی‌های نرم‌افزار باعث شده بنگاه‌های سنتی هم نیم‌نگاهی به گسترش نرم‌افزارها به صورت متن‌باز داشته باشند. آیا همچنان باید کدهای برنامه را در پستو نگه داشت؟ یا این که با انتشار کدها و گسترش نرم‌افزار به صورت متن‌باز هم، راهی برای پولدار شدن هست؟

            '
    ],

    //--------------------------------------------------------------

    'copyleft' => [
        'title' => 'Patents & Copyright',
        'presenter' => 'jadi',
        'level' => 'مبتدی و متوسط',
        'time' => '',
        'room' => 'سالن آمفی تئاتر',
        'desc' => '
            ...
            '
    ],

    //--------------------------------------------------------------

    'bigdata' => [
        'title' => 'Data Intensive Computing Platforms',
        'presenter' => 'peyberah',
        'level' => 'مبتدی و متوسط',
        'time' => '',
        'room' => 'سالن آمفی تئاتر',
        'desc' => '
در سال‌های اخیر، ما شاهد افزایش چشمگیر تولید داده بوده‌ایم. با تقریب می‌توان گفت که ۹۰٪ کل داده‌های ذخیره‌شده‌ی موجود در دنیا، در دو سال قبل تولید شده‌اند، و برای اولین بار در تاریخ، در سال ۲۰۰۷ بود که حجم داده‌های تولیدی فراتر از فضای موجود برای ذخیره‌سازی آن‌ها رفت. این داده‌های بزرگ، که Big Data نامیده می‌شوند، دارای مشخصات مشترکی هستند که می‌توان به حجم بالای داده، نرخ تولید بالا و تنوع محتوا اشاره کرد. برای ذخیره‌سازی و پردازش این داده‌های عظیم، ابزارهای متنوع و زیادی تولید شده‌است. تعداد و تنوع موجود در این ابزارها، امکان انتخاب ابزار مناسب برای کارهای مختلف را مشکل کرده‌است. بعضی از این ابزارها به صورت خاص‌منظوره و برای کار مشخصی طراحی شده‌اند (برای مثال برای پردازش داده‌های جاری و یا گراف)، و بعضی از آن‌ها، مانند Hadoop MapReduce و Spark، حالتی کلی‌تر دارند و برای انواع پردازش‌ها می‌توانند مورد استفاده قرار بگیرند. در این ارائه، سعی داریم تا مروری بر این ابزارها داشته باشیم و به طور خلاصه بعضی از آن‌ها را معرفی کنیم.<br>
<br>

            '
    ],

    //--------------------------------------------------------------

    'ssh' => [
        'title' => 'The Dark Arts of SSH',
        'presenter' => 'pooya',
        'level' => 'متوسط و پیشرفته',
        'time' => '',
        'room' => 'سالن آمفی تئاتر',
        'desc' => '
خیلیها تصور می کنند که SSH تنها یک ابزار برای اتصال به یک Shell در یک کامپیوتر دیگه هست. ولی در حقیقت همراه با ابزار SSH تعداد بیشماری از قابلیت در اختیار شما قرار می گیرد که از جمله‌ی آنها ایجاد کانکشن های امن و ایمن سازی کانکشن های غیر امن هست. <br><br>

توی این بحث شرکت کنید تا بعضی از پرکاربرد ترین قابلیت هایی که در SSH نهفته هست رو بررسی کنیم. <br><br>
پس اگه یک شناخت کلی و ساده از SSH دارید این ارایه رو از دست ندید. <br>

در طول ارایه مباحثی رو مطرح می کنیم از جمله :
<ul>
<li>
 کلیدهای امن SSH و نحوه ی پخش کردن آنها
</li>
<li>
 چندین کار خارق العاده با استفاده از قابلیت های Port forwarding و Reverse port forwarding
</li>
<li>
 ایجاد تونل بین دو سیستم
</li>
<li>
 بهبود سرعت و کارایی اتصال و معرفی ابزار های جایگزین
</li>
<li>
 Terminal Windowing systems
</li>
</ul>
            '
    ],

    //--------------------------------------------------------------

];

global $workshops;
$workshops = [

    'intro' => [
        'title' => 'Linux Intro',
        'presenter' => '',
        'level' => 'مبتدی و متوسط',
        'time' => 'هر دو روز',
        'room' => 'سایت کامپیوتر',
        'desc' => '
             اول شرکت کننده ها به طور مختصر با سیستم عامل لینوکس و قابلیت های اون آشنا می شن
            '
    ],

    //--------------------------------------------------------------

    'kernel' => [
        'title' => 'Linux kernel',
        'presenter' => 'bakhshis',
        'level' => 'متوسط و پیشرفته',
        'time' => 'هر دو روز',
        'room' => '',
        'desc' => '
شرکت‌کننده‌ها خیلی ساده با نحوه کار کردن کرنل لینوکس آشنا می‌شن و یه درایور ساده هم برای اون می‌نویسن
            '
    ],

    //--------------------------------------------------------------

    'network' => [
        'title' => 'Networking in linux',
        'presenter' => '',
        'level' => 'مبتدی و متوسط',
        'time' => 'هر دو روز',
        'room' => '',
        'desc' => '
با شرکت در این کارگاه نحوه کانفیگ کردن یک سیستم لینوکسی رو برای شبکه یاد می‌گیرید کارایی که می‌تونید بکنید شامل IP Settings, Routing Table و Firewall/NAT می‌شه
            '
    ],


    //--------------------------------------------------------------

    'programming' => [
        'title' => 'Linux API Programming',
        'presenter' => 'faraz',
        'level' => 'مبتدی و متوسط',
        'time' => 'هر دو روز',
        'room' => '',
        'desc' => '
این کارگاه برای آشنا شدن با APIهای استاندارد لینوکس برای زبان‌های C/C++ ساخته شده همچنین در قسمت دوم این کارگاه مباحثی هم درمورد Qt ارائه می‌شه
            '
    ],

    //--------------------------------------------------------------

    'python' => [
        'title' => 'Python',
        'presenter' => 'parham',
        'level' => 'مبتدی و متوسط',
        'time' => 'هر دو روز',
        'room' => 'کلاس ۱۰۱',
        'desc' => '
            یکی از زبانهایی که در سالهای احیر توانسته سهم زیادی از برنامه های تولید شده به صورت متن باز را به خود اختصاص دهد زبان پایتون است. این زبان ویژگی های بسیاری دارد از جمله میتوان به ارتباط بسیار خوب با آن با زبان C یا dynammic type بودن آن اشاره کرد. در این کارگاه قصد داریم با تعدادی از این ویژگی ها آشنا شویم. به طور کلی در طی این دو روز مباحثی همچون Socket Programming , Design Pattern ,  ... را معرفی میکنیم.
            '
    ],

];
