<?php

namespace App;

class Section extends StaticModel
{
    protected $guarded = [];

    public static $data = [

        // Workshops

        [
            'id' => 'intro',
            'type' => 'workshop',
            'title' => 'Linux Intro + Intermediate',
            'presenter' => '-',
            'level' => 'شروع کار',
            'time' => 'هر دو روز - ۸ تا ۱۶',
            'room' => 'سایت کامپیوتر',
            'desc' => '
     شرکت‌کنندگان در روز اول این کارگاه با محیط سیستم عامل لینوکس، محیط‌های گرافیکی و دیگر قابلیت‌های آن آشنا می‌شوند. در روز دوم شرکت‌کنندگان با محیط ترمینال، فایل سیستم لینوکس، پردازش فایل‌های متنی، نصب برنامه‌های مختلف، مدیریت processها، کار با vim و... آشنا می‌شوند. در پایان دو روز ارائه‌ای با عنوان How to Live Happily in Linux خواهیم داشت که به شرکت‌کنندگان می‌آموزد چگونه تمام کارهای روزمره‌ی خود را در لینوکس انجام دهند، بدون این که به سیستم عامل دیگری نیاز داشته باشند.
            '
        ],

        //--------------------------------------------------------------

        [
            'id' => 'kernel',
            'type' => 'workshop',
            'title' => 'Linux Kernel',
            'presenter' => 'bakhshis',
            'level' => 'متوسط و پیشرفته',
            'time' => 'هر دو روز - ۸ تا ۱۴',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => '
هدف از این کارگاه آشنایی بیش‌تر با هسته‌ی سیستم عامل GNU/Linux (در حقیقت خود Linux)‌ است. در این کارگاه ابتدا یک سری مفاهیم مهم کرنل مانند user-space و kernel-space توضیح داده می‌شود، س‍پس interfaceهایی که برای کار با کرنل وجود دارند توضیح داده می‌شود. در مرحله‌ی بعدی مراحل پیکربندی و نصب و راه‌اندازی یک نسخه‌ی جدید از کرنل بر روی یک سیستم را بررسی می‌کنیم. سپس وارد source code کرنل شده و با ساختار آن آشنا می‌شویم. مفهوم ماژول‌ها و مفاهیم مهم در module programming را بررسی می‌کنیم و ماژول‌های نمونه‌ای را توسعه داده و بررسی می‌کنیم.
<br>
<br>
فرض بر این است که افرادی که در این کارگاه شرکت می‌کنند دارای شرایط زیر هستند :<br>
۱- آشنایی کلی با مفاهیم سیستم‌عامل
<br>
۲- تسلط به Command Line و  Bash
<br>
۳- آشنا به مفاهیم compile کردن با استفاده از gcc و make
<br>
۴- داشتن یک laptop که سیستم عامل لینوکسی به همراه کامپایلر‌ها در آن نصب شده باشد
<br>
۵- داشتن علاقه!!!!
            '
        ],

        //--------------------------------------------------------------
        [
            'id' => 'network',
            'type' => 'workshop',
            'title' => 'Networking in Linux',
            'presenter' => 'peyman',
            'level' => 'متوسط',
            'time' => 'روز اول ۸ تا ۱۴',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => '
در این کارگاه شرکت‌کنندگان دستورات پایه و رفع عیب شبکه را در لینوکس می‌آموزند.
<br>
پیش‌نیاز:<br>
<ul><li>
آشنایی با TCP/IP
</li></ul>
            '
        ],

        //--------------------------------------------------------------
        [
            'id' => 'webserver',
            'type' => 'workshop',
            'title' => 'Webservers Powered by Linux',
            'presenter' => 'peyman',
            'level' => 'متوسط',
            'time' => 'روز دوم ۸ تا ۱۴',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => '
در این کارگاه شرکت‌کنندگان یاد می‌گیرند چگونه یک وب‌سرور Apache را نصب، تنظیم و نگهداری کنند.
<br>
سرفصل های کلی این کارگاه : <br>
<ul>
<li>Apache WebServer</li>
<li>PHP/CGI</li>
<li>MYSQL Server</li>
<li>WebServer & Configuration Tips</li>
</ul>
            '
        ],


        //--------------------------------------------------------------

        [
            'id' => 'programming',
            'type' => 'workshop',
            'title' => 'Linux API Programming',
            'presenter' => 'faraz',
            'level' => 'متوسط و پیشرفته',
            'time' => 'روز دوم ۸ تا ۱۴',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => '
در این کارگاه شرکت‌کنندگان با APIهای استاندارد لینوکس که برای زبان‌های C/C++ ساخته شده‌اند و همچنین مباحثی درمورد Qt آشنا می‌شوند.            '
        ],

        //--------------------------------------------------------------

        [
            'id' => 'python',
            'type' => 'workshop',
            'title' => 'Python',
            'presenter' => 'parham',
            'level' => 'متوسط',
            'time' => 'هر دو روز - ۸ تا ۱۴',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => '
یکی از زبان‌هایی که در سال‌های اخیر توانسته سهم زیادی از برنامه‌های تولیدشده به صورت متن‌باز را به خود اختصاص دهد زبان پایتون است. این زبان ویژگی‌های بسیاری دارد که از جمله می‌توان به ارتباط بسیار خوب با آن با زبان C یا dynamic type بودن آن اشاره کرد. در این کارگاه قصد داریم با تعدادی از این ویژگی‌ها آشنا شویم. به طور کلی در طی این دو روز مباحثی همچون Socket Programming، Design Patterns و... را معرفی می‌کنیم.            '
        ],

        // Presentations


        [
            'id' => 'sql',
            'type' => 'presentation',
            'title' => 'MySQL, NoSQL and a few Steps Further',
            'presenter' => 'nadalizadeh',
            'level' => 'متوسط',
            'time' => 'روز اول - ۱۵:۱۵ تا ۱۶:۰۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => '

در دنیای نرم افزارهای متن‌باز که حجم وسیعی از سرویس‌های اینترنتی بر پایه‌ی آن‌ها بنا شده است، کمتر کسی اسم MySQL به گوشش نخورده است. اولین قدم در راه‌اندازی یک سایت یا سرویس اینترنتی پویا، استفاده از پایگاه‌های داده‌ی این چنین است. MySQL پایدار، ثابت‌شده و ساده اما در عین حال با محدودیت‌هایی همراه است. در سال‌های اخیر شاهد به وجود آمدن پایگاه‌های داده‌ی متن‌باز و سنت‌شکن NoSQL هستیم که خود را به ساختار SQL و جدول‌بندی مرسوم محدود نمی‌کنند تا بازدهی بالاتری در برخی موارد داشته باشند. اما آیا می‌توان خوبی‌های روش سنتی و جسارت روش‌های جدید را در کنار هم داشت؟
<br>
آیا راه حل‌های جامعه‌ی Open Source می‌توانند در مقابل خدمات تجاری شرکت‌هایی همچون Microsoft و بخش تجاری و بسته‌ی Oracle حرفی برای گفتن داشته باشند؟
            '
        ],

        //--------------------------------------------------------------

        [
            'id' => 'opensource',
            'type' => 'presentation',
            'title' => 'OpenSource Revenue Concepts',
            'presenter' => 'mohajer',
            'level' => 'مبتدی و متوسط',
            'time' => 'روز اول - ۱۴:۱۵ تا ۱۵:۰۰',
            'room' => 'سالن آمفی تئاتر',
            'desc' => '
نرم‌افزارهای متن‌باز سال‌هاست که وجود دارند و همیشه بعد از شنیدن این واژه اولین چیزی که به ذهن همه‌ی ما می‌رسد «نرم‌افزار‌های رایگان» است. نرم‌افزار رایگان بلافاصله برای یک سرمایه‌گذار محصولی بدون درآمد و برای استفاده‌کننده محصولی بدون پشتیبانی را تداعی می‌کند. اما با این وجود بنگاه‌های متن‌باز توانسته‌اند در سال‌های گذشته با استفاده از مدل‌های درآمدزایی خاص خودشان سود زیادی به جیب بزنند.تغییر نیازهای مشتریان از محصول به خدمات، گسترش فوق‌العاده‌ی فضای مجازی و سرعت زیاد تغییر تکنولوژی‌های نرم‌افزار باعث شده بنگاه‌های سنتی هم نیم‌نگاهی به گسترش نرم‌افزارها به صورت متن‌باز داشته باشند. آیا همچنان باید کدهای برنامه را در پستو نگه داشت؟ یا این که با انتشار کدها و گسترش نرم‌افزار به صورت متن‌باز هم، راهی برای پولدار شدن هست؟

            '
        ],

        //--------------------------------------------------------------

        [
            'id' => 'copyleft',
            'type' => 'presentation',
            'title' => 'Patents & Copyright',
            'presenter' => 'danial',
            'level' => 'مبتدی و متوسط',
            'time' => 'روز اول - ۱۶:۱۵ تا ۱۷:۱۵',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => '
          در تاریخ نرم‌افزارهای آزاد، همواره نزاع‌هایی میان تفکّرهای مختلف فکری وجود داشته است: تفکّری که  وجود خود را وابسته به انحصار و بسته نگاه داشتن چیزهایی می‌پنداشته که آن را دارایی و حق خود می‌دانسته و عقیده داشته تنها با بازنده نگه داشتن دیگران می‌توان به پیروزی رسید. در مقابل تفکّری است که انسان‌ها را دارای آگاهی و شعور دانسته و عقیده دارد «پیروزی ما آن‌چیزی نیست که در آن کسی شکست بخورد. همه باید باهم کامیاب شویم، اگرچه برخی مژده‌ی این کامیابی را دیرتر درک کنند».
گروه نخست برای رسیدن به اهداف خود، به وسیله‌ی پول و قدرت و فریب، قوانینی را به‌وجود آورده، یا به پسند خود تغییر داده‌اند؛ قوانینی که به عقیده‌ی خودشان، می‌توانست پیروزی آن‌ها را در نبرد خیالی‌شان تضمین کند. از جمله‌ی این قوانین می‌توان به حق رونوشت (copyright)، حمایت از ایده‌ها (patent)، محدودیت‌های دیجیتالی (DRM) و... اشاره کرد.
<br>
در این ارائه قرار است گپی در رابطه با این قوانین، مشکلات حاصله و راه‌های مبارزه با آن‌ها داشته باشیم.

            '
        ],

        //--------------------------------------------------------------

        [
            'id' => 'bigdata',
            'type' => 'presentation',
            'title' => 'Data Intensive Computing Platforms',
            'presenter' => 'peyberah',
            'level' => 'مبتدی و متوسط',
            'time' => 'روز دوم - ۱۶:۱۵ تا ۱۷:۱۵',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => '
در سال‌های اخیر، شاهد افزایش چشم‌گیر تولید داده بوده‌ایم. با تقریب می‌توان گفت که ۹۰% کل داده‌های ذخیره‌شده‌ی موجود در دنیا، در دو سال قبل تولید شده‌اند، و برای اولین بار در تاریخ، در سال ۲۰۰۷ بود که حجم داده‌های تولیدی فراتر از فضای موجود برای ذخیره‌سازی آن‌ها رفت. این داده‌های بزرگ، که Big Data نامیده می‌شوند، دارای مشخصات مشترکی هستند که می‌توان به حجم بالای داده، نرخ تولید بالا و تنوع محتوا اشاره کرد. برای ذخیره‌سازی و پردازش این داده‌های عظیم، ابزارهای متنوع و زیادی تولید شده‌است. تعداد و تنوع موجود در این ابزارها، امکان انتخاب ابزار مناسب برای کارهای مختلف را مشکل کرده‌است. بعضی از این ابزارها به صورت خاص‌منظوره و برای کار مشخصی طراحی شده‌اند (برای مثال برای پردازش داده‌های جاری یا گراف)، و بعضی از آن‌ها، مانند Hadoop MapReduce و Spark، حالتی کلی‌تر دارند و برای انواع پردازش‌ها می‌توانند مورد استفاده قرار بگیرند. در این ارائه، سعی داریم تا مروری بر این ابزارها داشته باشیم و به طور خلاصه بعضی از آن‌ها را معرفی کنیم.<br>
            '
        ],

        //--------------------------------------------------------------

        [
            'id' => 'ssh',
            'type' => 'presentation',
            'title' => 'The Dark Arts of SSH',
            'presenter' => 'pooya',
            'level' => 'متوسط',
            'time' => 'روز دوم - ۱۴:۱۵ تا ۱۵',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => '
خیلی‌ها تصور می‌کنند که ابزار SSH تنها برای اتصال به ترمینال یک کامپیوتر دیگر است. ولی در حقیقت همراه با این ابزار تعداد بی‌شماری از قابلیت‌ها در اختیار شما قرار می‌گیرد که از جمله‌ی آن‌ها ایجاد کانکشن‌های امن و ایمن‌سازی کانکشن‌های غیر امن است. <br>
در این بحث شرکت کنید تا بعضی از پرکاربردترین قابلیت‌هایی که در SSH نهفته است را بررسی کنیم. <br>
در طول ارائه مباحثی را مطرح می‌کنیم از جمله:
<ul>
<li><p>
 کلیدهای امن SSH و نحوه ی Deploy کردن آن‌ها
</p></li>
<li><p>
چندین کاربرد Port Forwarding
</p></li>
<li><p>
 ایجاد تونل‌های امن بین دو سیستم
</p></li>
<li><p>
 بهبود سرعت و کارایی اتصال و معرفی ابزارهای جایگزین
</p></li>
<li><p>
 Terminal Windowing Systems
</p></li>
</ul>
            '
        ],

        //--------------------------------------------------------------

        [
            'id' => 'bazaar',
            'type' => 'presentation',
            'title' => 'OpenSource Infrastructure @CafeBazaar',
            'presenter' => 'reza',
            'level' => 'مبتدی و متوسط',
            'time' => 'روز دوم - ۳:۱۵  تا ۱۶',
            'room' => 'وبینار + سالن آمفی‌تئاتر',
            'desc' => '
        تقریباً تمامی لایه‌های زیرساخت کافه‌بازار روی محصولات Open Source قرار گرفته‌اند، و استثناهایش هم سرویس‌هایی است که از دیگر شرکت‌ها دریافت می‌کنیم. در این ارائه توضیح خواهیم داد که این محصولات چگونه در کنار هم قرار گرفته‌اند و توانسته‌اند سرویس نسبتاً پایداری به حدود ۲۰ میلیون کاربر بازار ارائه دهند. همچنین به مشکلاتی که در طول این سال‌ها در حین رشد خدمات و Scale تکنولوژی‌های استفاده شده داشتیم اشاره خواهیم کرد و راه‌حل‌هایی که نهایتاً مشکل را رفع کرده‌اند بیان خواهیم کرد.

            '
        ],


    ];

}
