<?php

namespace App;

/**
 * @property mixed id
 * @property mixed type
 * @property mixed title
 * @property mixed presenter
 * @property mixed level
 * @property mixed time
 * @property mixed room
 * @property mixed desc
 */
class Section extends StaticModel
{
    protected $guarded = [];
    
    public static $data = [

        // Workshops

        [
            'id' => 'setup',
            'type' => 'workshop',
            'title' => 'Setup Workshop',
            'presenter' => 'gholizade',
            'level' => 'شروع کار',
            'date' => '0',
            'time' => 'روز صفرم - ۱۳:۰۰ تا ۱۸:۰۰',
            'room' => 'سایت کامپیوتر',
            'desc' => '
نصب لینوکس و یک دورهمی با شرکت کنندگان!      '
        ],
        
        //--------------------------------------------------------------
        
        [
            'id' => 'intro',
            'type' => 'workshop',
            'title' => 'Linux Basic',
            'presenter' => 'gholizade',
            'level' => 'شروع کار',
            'date' => '1,2',
            'time' => 'هر دو روز - ۹ تا ۱۲:۳۰',
            'room' => 'سایت کامپیوتر',
            'desc' => '
     شرکت‌کنندگان در روز اول این کارگاه با محیط سیستم عامل لینوکس، محیط‌های گرافیکی و دیگر قابلیت‌های آن آشنا می‌شوند. در روز دوم شرکت‌کنندگان با محیط ترمینال، فایل سیستم لینوکس، پردازش فایل‌های متنی، نصب برنامه‌های مختلف، مدیریت processها، کار با vim و... آشنا می‌شوند. در پایان دو روز ارائه‌ای با عنوان How to Live Happily in Linux خواهیم داشت که به شرکت‌کنندگان می‌آموزد چگونه تمام کارهای روزمره‌ی خود را در لینوکس انجام دهند، بدون این که به سیستم عامل دیگری نیاز داشته باشند.
            '
        ],

        //--------------------------------------------------------------
        [
            'id' => 'network',
            'type' => 'workshop',
            'title' => 'Network & Security',
            'presenter' => 'rahimkhani',
            'level' => 'پیشرفته',
            'date' => '1,2',
            'time' => 'هر دو روز - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => 'به زودی اعلام می‌شود'
        ],

        //--------------------------------------------------------------

        [
            'id' => 'docker',
            'type' => 'workshop',
            'title' => 'Docker',
            'presenter' => 'pooya',
            'level' => 'پیشرفته',
            'date' => '1',
            'time' => 'روز اول - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => 'به زودی اعلام می‌شود'
        ],

        //--------------------------------------------------------------

        [
            'id' => 'scientific',
            'type' => 'workshop',
            'title' => 'MATLAB & Scientific Tools',
            'presenter' => null,
            'level' => 'متوسط',
            'date' => '2',
            'time' => 'روز دوم - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => 'توضیحات متعاقباً اعلام می‌شود...'
        ],

        //--------------------------------------------------------------

        [
            'id' => 'dataware_workshop',
            'type' => 'workshop',
            'title' => 'Data Warehouse Workshop',
            'presenter' => 'afshin',
            'level' => 'متوسط',
            'date' => '2',
            'time' => 'روز دوم - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => 'توضیحات متعاقباً اعلام می‌شود...'
        ],

        //--------------------------------------------------------------

        [
            'id' => 'webserver',
            'type' => 'workshop',
            'title' => 'Webservers',
            'presenter' => 'pooya',
            'level' => 'متوسط',
            'date' => '2',
            'time' => 'روز دوم ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => 'توضیحات متعاقباً اعلام می‌شود...'
        ],

        //--------------------------------------------------------------

        [
            'id' => 'system_on_a_board',
            'type' => 'workshop',
            'title' => 'System On a Board',
            'presenter' => 'abolfazl',
            'level' => 'متوسط',
            'date' => '1',
            'time' => 'روز اول - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => 'توضیحات متعاقباً اعلام می‌شود...'
        ],

        //--------------------------------------------------------------

        [
            'id' => 'embeded',
            'type' => 'workshop',
            'title' => 'Embeded Systems',
            'presenter' => 'abolfazl',
            'level' => 'متوسط',
            'date' => '2',
            'time' => 'روز دوم - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => 'توضیحات متعاقباً اعلام می‌شود...'
        ],

        //--------------------------------------------------------------

        [
            'id' => 'golang',
            'type' => 'workshop',
            'title' => 'GoLang',
            'presenter' => 'taher',
            'level' => 'متوسط',
            'date' => '1',
            'time' => 'روز اول - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => 'توضیحات متعاقباً اعلام می‌شود...'
        ],

        //--------------------------------------------------------------

        [
            'id' => 'python',
            'type' => 'workshop',
            'title' => 'Python',
            'presenter' => 'taher',
            'level' => 'متوسط',
            'date' => '1',
            'time' => 'روز اول - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => '
یکی از زبان‌هایی که در سال‌های اخیر توانسته سهم زیادی از برنامه‌های تولیدشده به صورت متن‌باز را به خود اختصاص دهد زبان پایتون است. این زبان ویژگی‌های بسیاری دارد که از جمله می‌توان به ارتباط بسیار خوب با آن با زبان C یا dynamic type بودن آن اشاره کرد. در این کارگاه قصد داریم با تعدادی از این ویژگی‌ها آشنا شویم. به طور کلی در طی این دو روز مباحثی همچون Socket Programming، Design Patterns و... را معرفی می‌کنیم.            '
        ],

        //--------------------------------------------------------------

        [
            'id' => 'pro',
            'type' => 'workshop',
            'title' => 'Linux Professional',
            'presenter' => 'pooya',
            'level' => 'پیشرفته',
            'date' => '2',
            'time' => 'روز دوم - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => 'توضیحات متعاقباً اعلام می‌شود...'
        ],

        // Presentations


        [
            'id' => 'laas',
            'type' => 'presentation',
            'title' => 'Cloud Computing I: IaaS, PaaS, and Iran',
            'presenter' => 'alijavadi',
            'level' => 'پیشرفته',
            'time' => 'روز اول - ۱۴:۰۰ تا ۱۴:۳۰',
            'date' => '1',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => '
همیشه در دسترس بودن همواره یکی از مهم‌ترین مسائل برای شرکت‌های سرویس‌دهنده در حوزهٔ فناوری اطلاعات بوده است. توسعهٔ نرم‌افزاری و ارتقای سرویس‌هایی که در هر لحظه از شبانه‌روز کاربر دارند چالشی جدی در این زمینه است. در چند سال اخیر با گسترش تکنولوژی‌های کانتینر تحولی گسترده در نحوهٔ نگرش به این مسئله رخ داده است.
<br>
در این بخش از ارائه‌های مربوط به رایانش ابری می‌خواهیم مروری کنیم بر این چالش‌ها و مجموعه روش‌هایی که برای حل این مسئله آمده و بعضاً رفته‌اند.
            '
        ],

        //--------------------------------------------------------------

        [
            'id' => 'kubernetes',
            'type' => 'presentation',
            'title' => 'Cloud Computing II: Kubernetes',
            'presenter' => 'alijavadi',
            'level' => 'پیشرفته',
            'date' => '1',
            'time' => 'روز اول - ۱۴:۳۰ تا ۱۵:۰۰',
            'room' => 'سالن آمفی تئاتر',
            'desc' => '
در میان راه‌حل‌هایی که برای حل موضوع همیشه در دسترس بودن بر اساس کانتینر ارائه شده است، Kubernetes به چند دلیل مورد توجه خیلی از شرکت‌ها قرار گرفته است. Kubernetes در استک تکنولوژی‌های ابری وظایف دو لایهٔ Scheduling و Orchestration را انجام می‌دهد.
<br>
در بخش دوم ارائه‌های مربوط به رایانش ابری می‌خواهیم در مورد نگاه متفاوتی که مهندسین گوگل در حل مسأله داشته‌اند و در پی آن Kubernetes را خلق کرده‌اند صحبت کنیم.
            '
        ],

        //--------------------------------------------------------------

        [
            'id' => 'docker',
            'type' => 'presentation',
            'title' => 'Docker',
            'presenter' => 'pooya',
            'level' => 'متوسط',
            'date' => '1',
            'time' => 'روز اول - ۱۵:۰۰ تا ۱۵:۳۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => 'توضیحات متعاقباً اعلام می‌شود...'
        ],

        //--------------------------------------------------------------

        [
            'id' => 'core_os',
            'type' => 'presentation',
            'title' => 'Cloud Computing III: CoreOS & Cloud-Config',
            'presenter' => 'nasiri',
            'level' => 'متوسط',
            'date' => '1',
            'time' => 'روز اول - ۱۵:۳۰ تا ۱۶:۰۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => '
در بخش اول ارائه‌های مربوط به رایانش ابری برای لایه‌های سخت‌افزار، Virtualization و سیستم عامل چند راه‌کار متداول مطرح شد. یکی از این راه‌کارها استفاده از یک سیستم عامل مینیمال بود. CoreOS هدف خود را چنین قرار داده است.
<br>
در این بخش می‌خواهیم دربارهٔ چند نوآوری CoreOS صحبت کنیم و سپس به سراغ Cloud-Config برویم که هر چند ایده‌اش از CoreOS نبوده است، ولی CoreOS از آن به خوبی بهره برده است.
            '
        ],


        //--------------------------------------------------------------

        [
            'id' => 'good',
            'type' => 'presentation',
            'title' => 'The goodies Everyone Must Have',
            'presenter' => 'taher',
            'level' => 'متوسط',
            'date' => '1',
            'time' => 'روز اول - ۱۶:۰۰ تا ۱۶:۳۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => 'توضیحات متعاقباً اعلام می‌شود...'
        ],

        //--------------------------------------------------------------

        [
            'id' => 'ubuntu_portable',
            'type' => 'presentation',
            'title' => 'Ubuntu on Portable Devices',
            'presenter' => 'danial',
            'level' => 'متوسط',
            'date' => '1',
            'time' => 'روز اول - ۱۶:۳۰ تا ۱۷:۰۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => 'توضیحات متعاقباً اعلام می‌شود...'
        ],

        //--------------------------------------------------------------
        // Discussion Board

        [
            'id' => 'board',
            'type' => 'Discussion Board On',
            'title' => 'Copy Right and Open Source',
            'presenter' => 'danial',
            'level' => 'پیشرفته',
            'date' => '1',
            'time' => 'روز اول - ۱۷:۰۰ تا ۱۸:۰۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => 'توضیحات متعاقباً اعلام می‌شود...'
        ],

        //--------------------------------------------------------------

        [
            'id' => 'lowlevel',
            'type' => 'presentation',
            'title' => 'Low Level Networking Inside Docker',
            'presenter' => 'pooya',
            'level' => 'متوسط',
            'date' => '2',
            'time' => 'روز دوم - ۱۵:۳۰ تا ۱۶:۰۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => 'توضیحات متعاقباً اعلام می‌شود...'
        ],

        //--------------------------------------------------------------

        [
            'id' => 'iot',
            'type' => 'presentation',
            'title' => 'Internet of Things and IPv6',
            'presenter' => 'parham',
            'level' => 'پیشرفته',
            'date' => '2',
            'time' => 'روز دوم - ۱۶:۰۰ تا ۱۶:۳۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => 'توضیحات متعاقباً اعلام می‌شود...'
        ],

        //--------------------------------------------------------------

        [
            'id' => 'dataware',
            'type' => 'presentation',
            'title' => 'Data Warehouse',
            'presenter' => 'afshin',
            'level' => 'متوسط',
            'date' => '2',
            'time' => 'روز دوم - ۱۶:۳۰ تا ۱۷:۰۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => 'توضیحات متعاقباً اعلام می‌شود...'
        ],

    ];

}
