<?php

namespace App;

/**
 * @property mixed id
 * @property mixed type
 * @property mixed title
 * @property mixed presenter
 * @property mixed level
 * @property mixed time
 * @property mixed room
 * @property mixed desc
 */
class Section extends StaticModel
{
    protected $guarded = [];
    
    public static $data = [

        // Workshops

        [
            'id' => 'setup',
            'type' => 'workshop',
            'title' => 'Setup Workshop',
            'presenter' => null,
            'level' => 'شروع کار',
            'date' => 0,
            'time' => 'روز صفرم - ۱۳:۰۰ تا ۱۸:۰۰',
            'room' => 'سایت کامپیوتر',
            'desc' => '
نصب لینوکس و یک دورهمی با شرکت کنندگان!
            '
        ],
        
        //--------------------------------------------------------------
        
        [
            'id' => 'intro',
            'type' => 'workshop',
            'title' => 'Linux Basic',
            'presenter' => 'gholizade',
            'level' => 'شروع کار',
            'date' => '1,2',
            'time' => 'هر دو روز - ۹ تا ۱۲:۳۰',
            'room' => 'سایت کامپیوتر',
            'desc' => '
     شرکت‌کنندگان در روز اول این کارگاه با محیط سیستم عامل لینوکس، محیط‌های گرافیکی و دیگر قابلیت‌های آن آشنا می‌شوند. در روز دوم شرکت‌کنندگان با محیط ترمینال، فایل سیستم لینوکس، پردازش فایل‌های متنی، نصب برنامه‌های مختلف، مدیریت processها، کار با vim و... آشنا می‌شوند. در پایان دو روز ارائه‌ای با عنوان How to Live Happily in Linux خواهیم داشت که به شرکت‌کنندگان می‌آموزد چگونه تمام کارهای روزمره‌ی خود را در لینوکس انجام دهند، بدون این که به سیستم عامل دیگری نیاز داشته باشند.
            '
        ],

        //--------------------------------------------------------------
        [
            'id' => 'network',
            'type' => 'workshop',
            'title' => 'Network & Security',
            'presenter' => 'rahimkhani',
            'level' => 'پیشرفته',
            'date' => '1,2',
            'time' => 'هر دو روز - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => ''
        ],

        //--------------------------------------------------------------

        [
            'id' => 'docker',
            'type' => 'workshop',
            'title' => 'Docker',
            'presenter' => 'pooya',
            'level' => 'پیشرفته',
            'date' => '1',
            'time' => 'روز اول - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => ''
        ],

        //--------------------------------------------------------------

        [
            'id' => 'scientific',
            'type' => 'workshop',
            'title' => 'MATLAB & Scientific Tools',
            'presenter' => null,
            'level' => 'متوسط',
            'date' => '2',
            'time' => 'روز دوم - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => ''
        ],

        //--------------------------------------------------------------

        [
            'id' => 'dataware_workshop',
            'type' => 'workshop',
            'title' => 'Data Warehouse Workshop',
            'presenter' => 'afshin',
            'level' => 'متوسط',
            
            'time' => 'روز دوم - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => ''
        ],

        //--------------------------------------------------------------

        [
            'id' => 'webserver',
            'type' => 'workshop',
            'title' => 'Webservers',
            'presenter' => 'pooya',
            'level' => 'متوسط',
            'time' => 'روز دوم ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => ''
        ],

        //--------------------------------------------------------------

        [
            'id' => 'system_on_a_board',
            'type' => 'workshop',
            'title' => 'System On a Board',
            'presenter' => 'abolfazl',
            'level' => 'متوسط',
            'time' => 'روز اول - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => ''
        ],

        //--------------------------------------------------------------

        [
            'id' => 'embeded',
            'type' => 'workshop',
            'title' => 'Embeded Systems',
            'presenter' => 'abolfazl',
            'level' => 'متوسط',
            'time' => 'روز دوم - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => ''
        ],

        //--------------------------------------------------------------

        [
            'id' => 'golang',
            'type' => 'workshop',
            'title' => 'GoLang',
            'presenter' => 'taher',
            'level' => 'متوسط',
            'time' => 'روز اول - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => ''
        ],

        //--------------------------------------------------------------

        [
            'id' => 'python',
            'type' => 'workshop',
            'title' => 'Python',
            'presenter' => 'taher',
            'level' => 'متوسط',
            'time' => 'روز اول - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => '
یکی از زبان‌هایی که در سال‌های اخیر توانسته سهم زیادی از برنامه‌های تولیدشده به صورت متن‌باز را به خود اختصاص دهد زبان پایتون است. این زبان ویژگی‌های بسیاری دارد که از جمله می‌توان به ارتباط بسیار خوب با آن با زبان C یا dynamic type بودن آن اشاره کرد. در این کارگاه قصد داریم با تعدادی از این ویژگی‌ها آشنا شویم. به طور کلی در طی این دو روز مباحثی همچون Socket Programming، Design Patterns و... را معرفی می‌کنیم.            '
        ],

        //--------------------------------------------------------------

        [
            'id' => 'pro',
            'type' => 'workshop',
            'title' => 'Linux Professional',
            'presenter' => 'pooya',
            'level' => 'پیشرفته',
            'time' => 'روز دوم - ۹ تا ۱۲:۳۰',
            'room' => 'بعدا اعلام می‌شود',
            'desc' => ''
        ],

        // Presentations


        [
            'id' => 'laas',
            'type' => 'presentation',
            'title' => 'Cloud Computing I: IaaS, PaaS, and Iran',
            'presenter' => 'alijavadi',
            'level' => 'پیشرفته',
            'time' => 'روز اول - ۱۴:۰۰ تا ۱۴:۳۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => '
همیشه در دسترس بودن همواره یکی از مهم‌ترین مسائل برای شرکت‌های سرویس‌دهنده در حوزهٔ فناوری اطلاعات بوده است. توسعهٔ نرم‌افزاری و ارتقای سرویس‌هایی که در هر لحظه از شبانه‌روز کاربر دارند چالشی جدی در این زمینه است. در چند سال اخیر با گسترش تکنولوژی‌های کانتینر تحولی گسترده در نحوهٔ نگرش به این مسئله رخ داده است.
<br>
در این بخش از ارائه‌های مربوط به رایانش ابری می‌خواهیم مروری کنیم بر این چالش‌ها و مجموعه روش‌هایی که برای حل این مسئله آمده و بعضاً رفته‌اند.
            '
        ],

        //--------------------------------------------------------------

        [
            'id' => 'kubernetes',
            'type' => 'presentation',
            'title' => 'Cloud Computing II: Kubernetes',
            'presenter' => 'alijavadi',
            'level' => 'پیشرفته',
            'time' => 'روز اول - ۱۴:۳۰ تا ۱۵:۰۰',
            'room' => 'سالن آمفی تئاتر',
            'desc' => '
در میان راه‌حل‌هایی که برای حل موضوع همیشه در دسترس بودن بر اساس کانتینر ارائه شده است، Kubernetes به چند دلیل مورد توجه خیلی از شرکت‌ها قرار گرفته است. Kubernetes در استک تکنولوژی‌های ابری وظایف دو لایهٔ Scheduling و Orchestration را انجام می‌دهد.
<br>
در بخش دوم ارائه‌های مربوط به رایانش ابری می‌خواهیم در مورد نگاه متفاوتی که مهندسین گوگل در حل مسأله داشته‌اند و در پی آن Kubernetes را خلق کرده‌اند صحبت کنیم.
            '
        ],

        //--------------------------------------------------------------

        [
            'id' => 'core_os',
            'type' => 'presentation',
            'title' => 'Cloud Computing III: CoreOS & Cloud-Config',
            'presenter' => 'nasiri',
            'level' => 'متوسط',
            'time' => 'روز اول - ۱۵:۳۰ تا ۱۶:۰۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => '
در بخش اول ارائه‌های مربوط به رایانش ابری برای لایه‌های سخت‌افزار، Virtualization و سیستم عامل چند راه‌کار متداول مطرح شد. یکی از این راه‌کارها استفاده از یک سیستم عامل مینیمال بود. CoreOS هدف خود را چنین قرار داده است.
<br>
در این بخش می‌خواهیم دربارهٔ چند نوآوری CoreOS صحبت کنیم و سپس به سراغ Cloud-Config برویم که هر چند ایده‌اش از CoreOS نبوده است، ولی CoreOS از آن به خوبی بهره برده است.
            '
        ],

        //--------------------------------------------------------------

        [
            'id' => 'docker',
            'type' => 'presentation',
            'title' => 'Docker',
            'presenter' => 'pooya',
            'level' => 'متوسط',
            'time' => 'روز اول - ۱۵:۰۰ تا ۱۵:۳۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => ''
        ],

        //--------------------------------------------------------------

        [
            'id' => 'good',
            'type' => 'presentation',
            'title' => 'The goodies Everyone Must Have',
            'presenter' => 'taher',
            'level' => 'متوسط',
            'time' => 'روز اول - ۱۶:۰۰ تا ۱۶:۳۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => ''
        ],

        //--------------------------------------------------------------

        [
            'id' => 'ubuntu_portable',
            'type' => 'presentation',
            'title' => 'Ubuntu on Portable Devices',
            'presenter' => 'danial',
            'level' => 'متوسط',
            'time' => 'روز اول - ۱۶:۳۰ تا ۱۷:۰۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => ''
        ],

        //--------------------------------------------------------------

        [
            'id' => 'lowlevel',
            'type' => 'presentation',
            'title' => 'Low Level Networking Inside Docker',
            'presenter' => 'pooya',
            'level' => 'متوسط',
            'time' => 'روز دوم - ۱۵:۳۰ تا ۱۶:۰۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => ''
        ],

        //--------------------------------------------------------------

        [
            'id' => 'iot',
            'type' => 'presentation',
            'title' => 'Internet of Things and IPv6',
            'presenter' => 'parham',
            'level' => 'پیشرفته',
            'time' => 'روز دوم - ۱۶:۰۰ تا ۱۶:۳۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => ''
        ],

        //--------------------------------------------------------------

        [
            'id' => 'dataware',
            'type' => 'presentation',
            'title' => 'Data Warehouse',
            'presenter' => 'afshin',
            'level' => 'متوسط',
            'time' => 'روز دوم - ۱۶:۳۰ تا ۱۷:۰۰',
            'room' => 'سالن آمفی‌تئاتر',
            'desc' => ''
        ],

        //--------------------------------------------------------------

//        [
//            'id' => 'bigdata',
//            'type' => 'presentation',
//            'title' => 'Data Intensive Computing Platforms',
//            'presenter' => 'peyberah',
//            'level' => 'مبتدی و متوسط',
//            'time' => 'روز دوم - ۱۶:۱۵ تا ۱۷:۱۵',
//            'room' => 'سالن آمفی‌تئاتر',
//            'desc' => '
//در سال‌های اخیر، شاهد افزایش چشم‌گیر تولید داده بوده‌ایم. با تقریب می‌توان گفت که ۹۰% کل داده‌های ذخیره‌شده‌ی موجود در دنیا، در دو سال قبل تولید شده‌اند، و برای اولین بار در تاریخ، در سال ۲۰۰۷ بود که حجم داده‌های تولیدی فراتر از فضای موجود برای ذخیره‌سازی آن‌ها رفت. این داده‌های بزرگ، که Big Data نامیده می‌شوند، دارای مشخصات مشترکی هستند که می‌توان به حجم بالای داده، نرخ تولید بالا و تنوع محتوا اشاره کرد. برای ذخیره‌سازی و پردازش این داده‌های عظیم، ابزارهای متنوع و زیادی تولید شده‌است. تعداد و تنوع موجود در این ابزارها، امکان انتخاب ابزار مناسب برای کارهای مختلف را مشکل کرده‌است. بعضی از این ابزارها به صورت خاص‌منظوره و برای کار مشخصی طراحی شده‌اند (برای مثال برای پردازش داده‌های جاری یا گراف)، و بعضی از آن‌ها، مانند Hadoop MapReduce و Spark، حالتی کلی‌تر دارند و برای انواع پردازش‌ها می‌توانند مورد استفاده قرار بگیرند. در این ارائه، سعی داریم تا مروری بر این ابزارها داشته باشیم و به طور خلاصه بعضی از آن‌ها را معرفی کنیم.<br>
//            '
//        ],

        //--------------------------------------------------------------

//        [
//            'id' => 'ssh',
//            'type' => 'presentation',
//            'title' => 'The Dark Arts of SSH',
//            'presenter' => 'pooya',
//            'level' => 'متوسط',
//            'time' => 'روز دوم - ۱۴:۱۵ تا ۱۵',
//            'room' => 'سالن آمفی‌تئاتر',
//            'desc' => '
//خیلی‌ها تصور می‌کنند که ابزار SSH تنها برای اتصال به ترمینال یک کامپیوتر دیگر است. ولی در حقیقت همراه با این ابزار تعداد بی‌شماری از قابلیت‌ها در اختیار شما قرار می‌گیرد که از جمله‌ی آن‌ها ایجاد کانکشن‌های امن و ایمن‌سازی کانکشن‌های غیر امن است. <br>
//در این بحث شرکت کنید تا بعضی از پرکاربردترین قابلیت‌هایی که در SSH نهفته است را بررسی کنیم. <br>
//در طول ارائه مباحثی را مطرح می‌کنیم از جمله:
//<ul>
//<li><p>
// کلیدهای امن SSH و نحوه ی Deploy کردن آن‌ها
//</p></li>
//<li><p>
//چندین کاربرد Port Forwarding
//</p></li>
//<li><p>
// ایجاد تونل‌های امن بین دو سیستم
//</p></li>
//<li><p>
// بهبود سرعت و کارایی اتصال و معرفی ابزارهای جایگزین
//</p></li>
//<li><p>
// Terminal Windowing Systems
//</p></li>
//</ul>
//            '
//        ],

        //--------------------------------------------------------------

//        [
//            'id' => 'bazaar',
//            'type' => 'presentation',
//            'title' => 'OpenSource Infrastructure @CafeBazaar',
//            'presenter' => 'reza',
//            'level' => 'مبتدی و متوسط',
//            'time' => 'روز دوم - ۳:۱۵  تا ۱۶',
//            'room' => 'وبینار + سالن آمفی‌تئاتر',
//            'desc' => '
//        تقریباً تمامی لایه‌های زیرساخت کافه‌بازار روی محصولات Open Source قرار گرفته‌اند، و استثناهایش هم سرویس‌هایی است که از دیگر شرکت‌ها دریافت می‌کنیم. در این ارائه توضیح خواهیم داد که این محصولات چگونه در کنار هم قرار گرفته‌اند و توانسته‌اند سرویس نسبتاً پایداری به حدود ۲۰ میلیون کاربر بازار ارائه دهند. همچنین به مشکلاتی که در طول این سال‌ها در حین رشد خدمات و Scale تکنولوژی‌های استفاده شده داشتیم اشاره خواهیم کرد و راه‌حل‌هایی که نهایتاً مشکل را رفع کرده‌اند بیان خواهیم کرد.
//
//            '
//        ],


    ];

}
