<section class="bg-primary" id="about">
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 text-center">
                <h2 class="section-heading">
                    درباره‌ی جشنواره
                </h2>
                <hr class="light">
                <p class="text-faded text-right" style="font-size: 23px;">
                    انجمن علمی دانشجویی دانشکده‌ی مهندسی کامپیوتر و فناوری اطلاعات دانشگاه صنعتی امیرکبیر، هر سال اقدام
                    به برگزاری همایشی با نام «جشنواره‌ی لینوکس امیرکبیر» می‌کند.<br> با توجه به نیاز روزافزون به آشنایی
                    با این سیستم عامل و نرم‌افزارهای متن‌باز، هر ساله تعداد زیادی از دانشجویان از سراسر کشور جهت شرکت در
                    این همایش ثبت نام می‌کنند. هشتمین دوره‌ی این همایش، در اردیبهشت سال 95 در دانشکده‌ی
                    مهندسی کامپیوتر و فناوری اطلاعات دانشگاه صنعتی امیرکبیر در قالب دو سطح مقدماتی و پیشرفته برگزار
                    می‌شود.<br> همچنین برای اولین بار در این دوره کارگاه‌های آموزشی پایتون و چندین جلسه‌ی بحث با محوریت
                    لینوکس و نرم‌افزارهای متن‌باز برگزار می‌شود. <br> هدف اصلی این دوره آشنایی بیش‌تر دانشجویان و
                    علاقه‌مندان با مفاهیم اصلی و پایه‌ای سیستم عامل لینوکس است.
                </p>
                <br>
                <h1>درخواست همکاری</h1>
                <p class="text-faded text-right" style="font-size: 23px;">
انجمن علمی دانشجویی دانشکده مهندسی کامپیوتر و فناوری اطلاعات دانشگاه صنعتی امیرکبیر به عنوان برگزار کننده جشنواره ملی لینوکس و نرم افزارهای متن باز امیرکبیر از شما دعوت می کند تا در صورت تمایل به همکاری  ( برگزاری  کارگاه ، ارائه علمی و یا حمایت های مادی و معنوی دیگر از این جشنواره ) با ما تماس برقرار نمایید.
اردیبهشت امسال دور هم جمع می شویم و هشتمین دوره جشنواره لینوکس و نرم افزارهای متن باز را برگزار خواهیم کرد.
تاریخ برگزاری جشنواره : 22 و 23 و 24 اردیبهشت 1395
محل برگزاری جشنواره : دانشکده مهندسی کامپیوتر دانشگاه صنعتی امیرکبیر

پست الکترونیکی: <a href="mailto:info@linuxfest.ir">info@linuxfest.ir</a>
                </p>
                <!--
                <a href="#presenters" class="page-scroll btn btn-default btn-xl">
                    کیا هستن؟
                </a>
                -->
            </div>
        </div>
    </div>
</section>
